Revit 2024 API
RebarUpdateCurvesData Class
 Class holding the information needed to calculate the rebar curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class RebarUpdateCurvesData : IDisposable
Visual Basic
Public Class RebarUpdateCurvesData _
	Implements IDisposable
Visual C++
public ref class RebarUpdateCurvesData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarUpdateCurvesData
See Also
RebarUpdateCurvesData Members
Autodesk.Revit.DB.Structure Namespace